app/views/histories/new.html.erb

  <div class="form-group">
    <%= select_tag(:vax, options_from_collection_for_select(Vaccination.all, :id, :science_name)) %>
---
SELECT "vaccinations".* FROM "vaccinations"