app/controllers/history_controller.rb

  def index
    @vaccinations = History.all
---
SELECT "histories".* FROM "histories"