app/controllers/histories_controller.rb

  def index
    @histories = History.all
---
SELECT "histories".* FROM "histories"

  def new
    @history = History.new
    @vaccination = Vaccination.all
---
SELECT "vaccinations".* FROM "vaccinations"

  def create
    v = Vaccination.find(params[:vax])
    history = current_user.histories.new(vaccination_params)
    history.user_id = current_user.id
    history.vaccination_id = v.id
    history.save
---
SELECT  "vaccinations".* FROM "vaccinations" WHERE "vaccinations"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "histories" ("clinic_name", "date_given", "expiry_date", "user_id", "vaccination_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"