app/controllers/vaccinations_controller.rb

  def index
    @vaccinations = Vaccination.all
---
SELECT "vaccinations".* FROM "vaccinations"